# Rank Series with `.rank()`

### Import Pandas

In [1]:
# import pandas
import pandas as pd
from pathlib import Path
path = Path('C:/Users/alouden01/Documents/python-pandas-for-data-manipulation/starter_files/skill_08_dataframe_sorting_ranking/mls_salaries.csv')

### Read CSV

In [3]:
salaries = pd.read_csv(path)
salaries.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

### No NaNs Allowed
To use the `rank()` method we will need to do some cleaning to remove all NaN values or the `rank()` method won't work.

In [6]:
salaries.dropna(how="any", inplace=True)

### Rank by base_salary

Now we can rank the base_column using the .rank() method and chaining the astype("int") method to convert to datatype from float to int.

In [7]:
# rank
salaries['base_salary'].rank().astype(int)

0      589
1      142
2      348
3      236
4       82
      ...
609    504
610    309
611    200
612    498
614    377
Name: base_salary, Length: 600, dtype: int64

### Create new column named ranked_salary
Create a new column named ranked_salary.

In [9]:
salaries['ranked_salary'] = salaries['base_salary'].rank(ascending=False).astype(int)
salaries.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,ranked_salary
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,12
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,459
2,ATL,Asad,Yamil,M,150000.0,150000.00,253
3,ATL,Bloom,Mark,D,99225.0,106573.89,365
4,ATL,Carleton,Andrew,F,65000.0,77400.00,519

Better yet, let's change the sorting direction while we're at it.

In [ ]:
# change direction with ascending=False

Finally, if we use the `sort_values()` method, descending, we will see the highest paid players ranked first.

In [10]:
# sort base_salary in reverse, showing the highest salary as number 1
salaries.sort_values('ranked_salary')

,club,last_name,first_name,position,base_salary,guaranteed_compensation,ranked_salary
560,TOR,Bradley,Michael,M,6000000.00,6500000.00,1
355,NYCFC,Villa,David,F,5610000.00,5610000.00,2
349,NYCFC,Pirlo,Andrea,M,5600000.00,5915690.00,3
568,TOR,Giovinco,Sebastian,F,5600000.00,7115555.67,3
55,CHI,Schweinsteiger,Bastian,M,5400000.00,5400000.00,5
...,...,...,...,...,...,...,...
214,KC,Pasher,Tyler,D-M,53000.00,53000.00,593
366,NYRB,Etienne,Derrick,M,53000.00,58000.00,593
281,MTL,Beland Goyette,Louis,M,53000.00,54250.00,593
523,SEA,Tolo,Nouhou,D,52999.92,52999.92,599
348,NYCFC,Okoli,Sean,F,52999.92,52999.92,599